{
  "personal_information": {
    "name": "Dobromir Stoyanov",
    "personal_image": "../assets/images/cat.jpg",
    "current_position": "Junior Front-End Developer",
    "image": "",
    "phone": "+359 876 961 085",
    "github_url": "https://github.com/dnstoyanov",
    "linkedin_url": "https://www.linkedin.com/in/dobromir-stoyanov/",
    "email_address": "dobromir.nikolov.s@gmail.com",
    "address": "Stara Zagora, Bulgaria",
    "about_me": "As a detail-oriented and innovative Front-End Developer with over a year of experience, I specialize in creating responsive web applications that focus on user engagement. Skilled in HTML, CSS, JavaScript, and React, I have a strong foundation in converting complex designs into functional website components. My journey in front-end development began with self-directed learning and specialized courses, highlighting my dedication to mastery and innovation. I am adept at using modern web technologies to enhance user experiences, with a keen understanding of UI design principles. My expertise in React and React Native allows me to develop engaging web and mobile applications that meet the latest UX standards. I am passionate about utilizing web technology to improve user interactions, aiming to contribute significantly to the success of a progressive development team."
  },
  "work_history": [
    {
      "position": "Junior Front-End Developer",
      "company": "Celtis LLC",
      "start_date": "09/2023",
      "end_date": "03/2024",
      "employment_type": "Full Time",
      "location": "Remote",
      "jobDescription": ["Building Mobile and Web Applications"],
      "projects": [
        {
          "project_name": "iClinic",
          "project_url": null,
          "start_date": "2023/01",
          "end_date": "2024/03",
          "project_description": [
            "iClinic is a comprehensive healthcare management system designed to help managing a cosmetic clinic. It provides a wide range of features, including appointment scheduling, patient management, and inventory management, to streamline the clinic’s operations and enhance patient care."
          ],
          "projectResponsibilities": [
            "Designing and implementing a highly intuitive and user-friendly front-end for the iClinic healthcare management system, leveraging React to align with the aesthetic and functional requirements of cosmetic clinics.",
            "Building responsive and accessible UI components for features such as appointment scheduling and  patient management, ensuring a seamless experience across desktop and mobile devices.",
            "Integrating RESTful APIs for real-time data exchange between the iClinic front-end and backend services, enabling up-to-date patient information and appointment schedules."
          ],
          "project_outcome": null,
          "tech_stack": [
            "React",
            "TypeScript",
            "CSS",
            "REST/RESTful API's",
            "Context API"
          ],
          "areas": ["eTrade"]
        },
        {
          "project_name": "Reloaders",
          "project_url": null,
          "start_date": "2023/12",
          "end_date": "2024/02",
          "project_description": [
            "Reloaders is an app for shooting enthusiasts. It enables users to track their shooting performance, simplifying the entire shooting experience in one mobile platform.  The app provides a range of features, including shot tracking, performance analysis to enhance the shooting experience for users."
          ],
          "projectResponsibilities": [
            "Developing a custom UI based on client-provided designs, tailored specifically for the Reloaders app to ensure a seamless and engaging user experience, optimised for both Android and iOS platforms.",
            "Creating custom hooks, reusable components, and sophisticated business logic to meet the requirements of the Reloaders platform",
            "Integratin RESTful APIs for real-time and offline data exchange between the Reloaders front-end and backend services, ensuring a seamless and responsive user experience."
          ],
          "project_outcome": null,
          "tech_stack": [
            "React Native",
            "TypeScript",
            "CSS",
            "REST/RESTful API's",
            "Context API"
          ],
          "areas": ["eTrade"]
        },
        {
          "project_name": "eSimatic",
          "project_url": null,
          "start_date": "2023/10",
          "end_date": "2023/12",
          "project_description": [
            "eSimatic emerged as a groundbreaking mobile application, strategically envisioned to transform the global telecommunications landscape by revolutionizing how eSIMs are distributed, sold, and managed. The application has been designed to provide a seamless and secure experience for both end-users and service providers, offering a range of features such as eSIM activation, management, and distribution."
          ],
          "projectResponsibilities": [
            "Creating a custom UI provided by the client’s designs",
            "Develop high-quality, responsive, and accessible UIs components",
            "Creating custom hooks, reusable components and business logic to match the client’s requirements"
          ],
          "project_outcome": null,
          "tech_stack": [
            "React Native",
            "TypeScript",
            "CSS",
            "REST/RESTful API's",
            "Context API"
          ],
          "areas": ["Communication"]
        }
      ]
    },
    {
      "position": "Junior Front-End Developer",
      "company": "NexGen LLC",
      "start_date": "01/2023",
      "end_date": "07/2023",
      "employment_type": "Full Time",
      "location": "Remote",
      "jobDescription": [""],
      "projects": [
        {
          "project_name": "Business Notification Center for AT&T",
          "project_url": null,
          "start_date": "2023/01",
          "end_date": null,
          "project_description": [
            "BNC was a dedicated communication platform designed specifically for first responders, enabling seamless chat messaging and video calls among emergency personnel. This powerful app enhances real-time collaboration, coordination, and decision-making in critical situations."
          ],
          "projectResponsibilities": [
            "Developed and implemented functionalities for creating new conversations between users.",
            "Adjusted functionalities related to conversation management for seamless chat messaging, including editing conversations and adding or deleting users from them.",
            "Created functionalities for creating and managing groups in the BNC App.",
            "Implemented adjusted group functionalities for both the client and admin parts of the application.",
            "Collaborated with the development team to integrate work effectively."
          ],
          "project_outcome": "The successful development and implementation of the BNC App will result in several significant outcomes, revolutionizing communication and collaboration among first responders in emergency situations.",
          "tech_stack": [
            "React",
            "TypeScript",
            "MUI",
            "HTML",
            "CSS",
            "REST/RESTful API's",
            "Redux"
          ],
          "areas": ["Communication"]
        }
      ]
    },
    {
      "position": "Web Designer",
      "company": "Kukui Corporation",
      "start_date": "02/2017",
      "end_date": "04/2021",
      "employment_type": "Full Time",
      "location": "Remote",
      "jobDescription": [
        "As a meticulous and innovative front-end developer, I bring over an year of focused experience in crafting responsive, user-focused web and mobile applications. My expertise spans HTML, CSS, JavaScript, and React, with a foundation built on a self-directed learning journey and targeted coursework. I am adept at transforming design blueprints into functional, dynamic web components, driven by a passion for utilizing the latest web technologies to enhance user experience. My proficiency extends to developing both React and React Native applications, with a keen eye for implementing UX principles to style web pages effectively. My approach combines technical skill with a creative mindset to push the boundaries of web development."
      ],
      "projects": [
        {
          "project_name": null,
          "project_url": null,
          "start_date": null,
          "end_date": null,
          "project_description": null,
          "projectResponsibilities": [
            "Translating business requirements into compelling designs",
            "Conducting user research and applying industry best practices",
            "Designing intuitive and engaging user interfaces",
            "Conducting usability testing and iterating designs",
            "Collaborating with clients, project managers, and developers"
          ],
          "project_outcome": null,
          "tech_stack": ["Adobe Photoshop", "Adobe Illustrator", "Figma"],
          "areas": ["Communication"]
        }
      ]
    }
  ],
  "education": [
    {
      "level_of_education": "",
      "degree": "Computer systems and technologies",
      "place": "Angel Kanchev - University of Ruse",
      "location": "Ruse, Bulgaria",
      "start_date": "01/09/2002",
      "end_date": "31/06/2004"
    }
  ],
  "languages": [
    {
      "name": "Bulgarian",
      "level": "Native"
    },
    {
      "name": "English",
      "level": "C1"
    },
    {
      "name": "Russian",
      "level": "B2"
    }
  ],
  "certifications": [
    {
      "name": "Scrum Alliance Certified ScrumMaster®",
      "organisation": "Scrum Alliance"
    }
  ],
  "training": [
    {
      "name": "SoftServe Academy - ReactSelfPaced",
      "description": "Practical skills for the development of SPA using ReactJS - JSX syntax, working with requests and Promises, splitting an application into components, using React Router, Hooks, Context API, Redux Toolkit, Material UI, linters, React Hook Form"
    },
    {
      "name": "Software Univesity 2021: ReactJS",
      "description": "Knowledge of Single Page Applications using ReactJS - JSX syntax, working with requests and Promises, splitting an application intocomponents, routing and validating  forms, React Hooks and the Context API"
    },
    {
      "name": "Software Univesity2021 JS: Basic to Advanced",
      "description": "Gained a solid foundation in JavaScript, covering syntax, variables, functions, and DOM manipulation. You have advanced to more complex topics like asynchronous programming, closures, and modular programming. "
    }
  ],
  "skills": [
    {
      "programmingSkills": [
        "JavaScript",
        "React",
        "React Native",
        "Next.js",
        "TypeScript",
        "Redux",
        "HTML",
        "CSS",
        "SASS",
        "Bootstrap",
        "Tailwind CSS"
      ]
    },
    {
      "additionalSkills": [
        "Adobe Creative Suite",
        "Git",
        "Jira",
        "Agile",
        "Figma",
        "Material UI"
      ]
    },
    {
      "softSkills": [
        "Problem solving",
        "Team Work",
        "Creativity",
        " Communication",
        " Self-Awareness"
      ]
    }
  ],
  "additional_information": {
    "publications": {},
    "cloud_certifications": {},
    "certifications_and_awards": {},
    "Internships": {}
  }
}
